Aggregate Function

In [122]:
'''
Aggregate Function takes a set of values and returns a single result
 mean -> average
 sum -> adds up all values
 min -> smallest one
 count -> count total number of record

 unique -> Shows all unique records
 nunique -> shows unique records count

 values_count ->  shows records and their counts

'''

'''
Data -> 
  Categorica -> Nominal Ordinal
  Numerical -> Discrete Continous
'''

'\nData -> \n  Categorica -> Nominal Ordinal\n  Numerical -> Discrete Continous\n'

In [123]:
import pandas as pd

In [124]:
df = pd.read_csv('Employees.csv')
df.head(10)

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,100,Steven,King,SKING,515.123.4567,17.06.2003,AD_PRES,24000,NaN,NaN,90.0
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,21.09.2005,AD_VP,17000,NaN,100.0,90.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,13.01.2001,AD_VP,17000,NaN,100.0,90.0
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,03.01.2006,IT_PROG,9000,NaN,102.0,60.0
4,104,Bruce,Ernst,BERNST,590.423.4568,21.05.2007,IT_PROG,6000,NaN,103.0,60.0
5,105,David,Austin,DAUSTIN,590.423.4569,25.06.2005,IT_PROG,4800,NaN,103.0,60.0
6,106,Valli,Pataballa,VPATABAL,590.423.4560,05.02.2006,IT_PROG,4800,NaN,103.0,60.0
7,107,Diana,Lorentz,DLORENTZ,590.423.5567,07.02.2007,IT_PROG,4200,NaN,103.0,60.0
8,108,Nancy,Greenberg,NGREENBE,515.124.4569,17.08.2002,FI_MGR,12008,NaN,101.0,100.0
9,109,Daniel,Faviet,DFAVIET,515.124.4169,16.08.2002,FI_ACCOUNT,9000,NaN,108.0,100.0

In [125]:
#Find average salary of employees
avg_salary = df['SALARY'].mean()
print(f'Average Salary : Rs {avg_salary:.2f}')

Average Salary : Rs 6560.58

In [126]:
#Find total salary of employees
total_salary = df['SALARY'].sum()
print(f'Total Salary : Rs {total_salary}')

Total Salary : Rs 728224

In [127]:
#Find max salary of employees
max_salary = df['SALARY'].max()
min_salary = df['SALARY'].min()

print(f'Min Salary : Rs {min_salary}')
print(f'Max Salary : Rs {max_salary}')

count_emp = df['EMPLOYEE_ID'].count()
print(f'Employee Count : {count_emp}')

Min Salary : Rs 2100
Max Salary : Rs 24000
Employee Count : 111

In [128]:
uniq_salary = df['SALARY'].unique()
print(f'Unique salary : {uniq_salary}')


uniq_sal_count = df['SALARY'].nunique()
print('')
print(f'uniq_sal_num : {uniq_sal_count}')

uniq_sal_values = df['SALARY'].value_counts()
print('')
print(uniq_sal_values)

Unique salary : [24000 17000  9000  6000  4800  4200 12008  8200  7700  7800  6900 11000
  3100  2900  2800  2600  2500  8000  7900  6500  5800  3200  2700  2400
  2200  3300  2100  3600  3500 14000 13500 12000 10500 10000  9500  7500
  7000  7200  6800  6400  6200 11500  9600  7400  7300  6100  8800  8600
  8400  4100  3400  3000  3800  4000  3900  4400 13000  8300]

uniq_sal_num : 58

SALARY
2500     6
10000    5
2600     4
2800     4
3100     4
3200     4
9000     4
2900     3
11000    3
8000     3
6500     3
7000     3
9500     3
12008    3
6000     2
2200     2
2400     2
8200     2
3300     2
2700     2
7500     2
6200     2
3600     2
4800     2
17000    2
4200     2
3000     2
8300     2
10500    2
5800     1
7700     1
24000    1
6900     1
7800     1
7900     1
12000    1
13500    1
14000    1
7200     1
6800     1
3500     1
2100     1
11500    1
6400     1
9600     1
7400     1
8800     1
8600     1
7300     1
6100     1
4100     1
8400     1
3800     1
3400     1
4000     1
3900     1
4400     1
13000    1
Name: count, dtype: int64

GROUPBY

In [129]:
#Find salary total of employees by each department

Total_dep_sal = df.groupby('DEPARTMENT_ID')['SALARY'].sum().reset_index()
Total_dep_sal

    DEPARTMENT_ID  SALARY
0            10.0    4400
1            20.0   19000
2            30.0   24900
3            40.0   13000
4            50.0  156400
5            60.0   28800
6            70.0   20000
7            80.0  304500
8            90.0   58000
9           100.0   51608
10          110.0   40616

In [130]:
#Find total salary , average salary , max salary , min salary by job_id

job_salary_group_by_job_id = df.groupby('DEPARTMENT_ID').agg(
     Total_sal = ('SALARY','sum'),
     Avg_Sal = ('SALARY', 'mean'),
     Min_Sal = ('SALARY', 'min'),
     Max_Sal = ('SALARY', 'max')
     
     ).reset_index()

job_salary_group_by_job_id

    DEPARTMENT_ID  Total_sal       Avg_Sal  Min_Sal  Max_Sal
0            10.0       4400   4400.000000     4400     4400
1            20.0      19000   9500.000000     6000    13000
2            30.0      24900   4150.000000     2500    11000
3            40.0      13000   6500.000000     6500     6500
4            50.0     156400   3475.555556     2100     8200
5            60.0      28800   5760.000000     4200     9000
6            70.0      20000  10000.000000    10000    10000
7            80.0     304500   8955.882353     6100    14000
8            90.0      58000  19333.333333    17000    24000
9           100.0      51608   8601.333333     6900    12008
10          110.0      40616  10154.000000     8300    12008

Find totalsalary, average salary of employees by job id , department id

In [131]:
#using groupby in multiple columns
emp_salary = df.groupby(['JOB_ID','DEPARTMENT_ID']).agg(
    Total_salar = ('SALARY', 'sum'),
    Average_sal = ('SALARY', 'mean')
).reset_index()

# emp_salary = df.groupby(['JOB_ID','DEPARTMENT_ID'])['SALARY'].agg('sum', 'mean').reset_index()

emp_salary

        JOB_ID  DEPARTMENT_ID  Total_salar   Average_sal
0   AC_ACCOUNT          110.0        16600   8300.000000
1       AC_MGR          110.0        24016  12008.000000
2      AD_ASST           10.0         4400   4400.000000
3      AD_PRES           90.0        24000  24000.000000
4        AD_VP           90.0        34000  17000.000000
5   FI_ACCOUNT          100.0        39600   7920.000000
6       FI_MGR          100.0        12008  12008.000000
7       HR_REP           40.0        13000   6500.000000
8      IT_PROG           60.0        28800   5760.000000
9       MK_MAN           20.0        13000  13000.000000
10      MK_REP           20.0         6000   6000.000000
11      PR_REP           70.0        20000  10000.000000
12    PU_CLERK           30.0        13900   2780.000000
13      PU_MAN           30.0        11000  11000.000000
14      SA_MAN           80.0        61000  12200.000000
15      SA_REP           80.0       243500   8396.551724
16    SH_CLERK           50.0        64300   3215.000000
17    ST_CLERK           50.0        55700   2785.000000
18      ST_MAN           50.0        36400   7280.000000

PIZZA DATA SET QUESTIONS

In [132]:
'''  
1. Find the total number of pizza sold by pizza category
2. Find the total quantity of pizza sold by pizza size
3. FInd total sales by each months
4. Find   total unit price, average price 
'''

'  \n1. Find the total number of pizza sold by pizza category\n2. Find the total quantity of pizza sold by pizza size\n3. FInd total sales by each months\n4. Find   total unit price, average price \n'

In [133]:
df_pizza = pd.read_csv('pizza_sales.csv')

In [134]:
df_pizza.head(10)

,pizza_id,order_id,pizza_name_id,quantity,order_date,order_time,unit_price,total_price,pizza_size,pizza_category,pizza_ingredients,pizza_name
0,1,1,hawaiian_m,1,1/1/2015,11:38:36,13.25,13.25,M,Classic,"Sliced Ham, Pineapple, Mozzarella Cheese",The Hawaiian Pizza
1,2,2,classic_dlx_m,1,1/1/2015,11:57:40,16.00,16.00,M,Classic,"Pepperoni, Mushrooms, Red Onions, Red Peppers,...",The Classic Deluxe Pizza
2,3,2,five_cheese_l,1,1/1/2015,11:57:40,18.50,18.50,L,Veggie,"Mozzarella Cheese, Provolone Cheese, Smoked Go...",The Five Cheese Pizza
3,4,2,ital_supr_l,1,1/1/2015,11:57:40,20.75,20.75,L,Supreme,"Calabrese Salami, Capocollo, Tomatoes, Red Oni...",The Italian Supreme Pizza
4,5,2,mexicana_m,1,1/1/2015,11:57:40,16.00,16.00,M,Veggie,"Tomatoes, Red Peppers, Jalapeno Peppers, Red O...",The Mexicana Pizza
5,6,2,thai_ckn_l,1,1/1/2015,11:57:40,20.75,20.75,L,Chicken,"Chicken, Pineapple, Tomatoes, Red Peppers, Tha...",The Thai Chicken Pizza
6,7,3,ital_supr_m,1,1/1/2015,12:12:28,16.50,16.50,M,Supreme,"Calabrese Salami, Capocollo, Tomatoes, Red Oni...",The Italian Supreme Pizza
7,8,3,prsc_argla_l,1,1/1/2015,12:12:28,20.75,20.75,L,Supreme,"Prosciutto di San Daniele, Arugula, Mozzarella...",The Prosciutto and Arugula Pizza
8,9,4,ital_supr_m,1,1/1/2015,12:16:31,16.50,16.50,M,Supreme,"Calabrese Salami, Capocollo, Tomatoes, Red Oni...",The Italian Supreme Pizza
9,10,5,ital_supr_m,1,1/1/2015,12:21:30,16.50,16.50,M,Supreme,"Calabrese Salami, Capocollo, Tomatoes, Red Oni...",The Italian Supreme Pizza

In [135]:
#1. Find the total number of pizza sold by pizza category
pizza_category__sold = df_pizza.groupby('pizza_category')['pizza_id'].unique()
pizza_category__sold

pizza_category
Chicken    [6, 11, 25, 26, 27, 28, 30, 31, 32, 42, 43, 61...
Classic    [1, 2, 12, 15, 17, 29, 35, 36, 39, 41, 53, 54,...
Supreme    [4, 7, 8, 9, 10, 13, 14, 18, 19, 21, 33, 38, 4...
Veggie     [3, 5, 16, 20, 22, 23, 24, 34, 37, 40, 45, 46,...
Name: pizza_id, dtype: object

In [136]:
# 2. Find the total quantity of pizza sold by pizza size

pizza_size_sold  = df_pizza.groupby('pizza_size')['quantity'].count()
pizza_size_sold

pizza_size
L      18526
M      15385
S      14137
XL       544
XXL       28
Name: quantity, dtype: int64

In [137]:
# 3. FInd total sales by each months
df_pizza['order_date'] = pd.to_datetime(df_pizza['order_date'], format="mixed")
# print(df_pizza['order_date'])

df_pizza['month'] = df_pizza['order_date'].dt.month_name()
print(df_pizza['month'].unique())

df_pizza['day'] = df_pizza['order_date'].dt.day_name()
print(df_pizza['day'].unique()
)

df_pizza

['January' 'February' 'March' 'April' 'May' 'June' 'July' 'August'
 'September' 'October' 'November' 'December']
['Thursday' 'Sunday' 'Wednesday' 'Friday' 'Monday' 'Saturday' 'Tuesday']

,pizza_id,order_id,pizza_name_id,quantity,order_date,order_time,unit_price,total_price,pizza_size,pizza_category,pizza_ingredients,pizza_name,month,day
0,1,1,hawaiian_m,1,2015-01-01,11:38:36,13.25,13.25,M,Classic,"Sliced Ham, Pineapple, Mozzarella Cheese",The Hawaiian Pizza,January,Thursday
1,2,2,classic_dlx_m,1,2015-01-01,11:57:40,16.00,16.00,M,Classic,"Pepperoni, Mushrooms, Red Onions, Red Peppers,...",The Classic Deluxe Pizza,January,Thursday
2,3,2,five_cheese_l,1,2015-01-01,11:57:40,18.50,18.50,L,Veggie,"Mozzarella Cheese, Provolone Cheese, Smoked Go...",The Five Cheese Pizza,January,Thursday
3,4,2,ital_supr_l,1,2015-01-01,11:57:40,20.75,20.75,L,Supreme,"Calabrese Salami, Capocollo, Tomatoes, Red Oni...",The Italian Supreme Pizza,January,Thursday
4,5,2,mexicana_m,1,2015-01-01,11:57:40,16.00,16.00,M,Veggie,"Tomatoes, Red Peppers, Jalapeno Peppers, Red O...",The Mexicana Pizza,January,Thursday
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
48615,48616,21348,ckn_alfredo_m,1,2015-12-31,21:23:10,16.75,16.75,M,Chicken,"Chicken, Red Onions, Red Peppers, Mushrooms, A...",The Chicken Alfredo Pizza,December,Thursday
48616,48617,21348,four_cheese_l,1,2015-12-31,21:23:10,17.95,17.95,L,Veggie,"Ricotta Cheese, Gorgonzola Piccante Cheese, Mo...",The Four Cheese Pizza,December,Thursday
48617,48618,21348,napolitana_s,1,2015-12-31,21:23:10,12.00,12.00,S,Classic,"Tomatoes, Anchovies, Green Olives, Red Onions,...",The Napolitana Pizza,December,Thursday
48618,48619,21349,mexicana_l,1,2015-12-31,22:09:54,20.25,20.25,L,Veggie,"Tomatoes, Red Peppers, Jalapeno Peppers, Red O...",The Mexicana Pizza,December,Thursday
48619,48620,21350,bbq_ckn_s,1,2015-12-31,23:02:05,12.75,12.75,S,Chicken,"Barbecued Chicken, Red Peppers, Green Peppers,...",The Barbecue Chicken Pizza,December,Thursday

In [138]:
#find total sales by month , day

sale_month = df_pizza.groupby('month')['total_price'].sum().reset_index()
print(sale_month)

sale_day = df_pizza.groupby('day')['total_price'].sum().reset_index()
print('')
print('')
print('--------------')
print('--------------')
print('')
print('')

print(sale_day)

        month  total_price
0       April     70312.00
1      August     69497.30
2    December     61058.10
3    February     64419.45
4     January     71620.15
5        July     70880.65
6        June     68161.45
7       March     71301.40
8         May     67648.80
9    November     71004.85
10    October     68152.20
11  September     63803.70


--------------
--------------


         day  total_price
0     Friday    129690.90
1     Monday    110471.60
2   Saturday    121605.15
3     Sunday    102116.45
4   Thursday    121650.30
5    Tuesday    115594.45
6  Wednesday    116731.20

Custom Category

In [139]:
''' As our month and day are not in order 
so we can create our own order using categorical
'''

weekday = ['Sunday','Monday','Tuesday','Wednesday','Thursday','Friday','Saturday']
df_pizza['day'] = pd.Categorical(df_pizza['day'], weekday)

'''  now if we print day we will get in order'''

print(sale_day)

         day  total_price
0     Friday    129690.90
1     Monday    110471.60
2   Saturday    121605.15
3     Sunday    102116.45
4   Thursday    121650.30
5    Tuesday    115594.45
6  Wednesday    116731.20

Doing for time

In [156]:
#changing order time into date time
df_pizza['order_time'] = pd.to_datetime(df_pizza['order_time'], format='%H:%M:%S')
 
df_pizza['hour'] = df_pizza['order_time'].dt.hour
df_pizza['min'] = df_pizza['order_time'].dt.minute
df_pizza['sec'] = df_pizza['order_time'].dt.second

df_pizza

,pizza_id,order_id,pizza_name_id,quantity,order_date,order_time,unit_price,total_price,pizza_size,pizza_category,pizza_ingredients,pizza_name,month,day,hour,min,sec
0,1,1,hawaiian_m,1,2015-01-01,2025-12-18 11:38:36,13.25,13.25,M,Classic,"Sliced Ham, Pineapple, Mozzarella Cheese",The Hawaiian Pizza,January,Thursday,11,38,36
1,2,2,classic_dlx_m,1,2015-01-01,2025-12-18 11:57:40,16.00,16.00,M,Classic,"Pepperoni, Mushrooms, Red Onions, Red Peppers,...",The Classic Deluxe Pizza,January,Thursday,11,57,40
2,3,2,five_cheese_l,1,2015-01-01,2025-12-18 11:57:40,18.50,18.50,L,Veggie,"Mozzarella Cheese, Provolone Cheese, Smoked Go...",The Five Cheese Pizza,January,Thursday,11,57,40
3,4,2,ital_supr_l,1,2015-01-01,2025-12-18 11:57:40,20.75,20.75,L,Supreme,"Calabrese Salami, Capocollo, Tomatoes, Red Oni...",The Italian Supreme Pizza,January,Thursday,11,57,40
4,5,2,mexicana_m,1,2015-01-01,2025-12-18 11:57:40,16.00,16.00,M,Veggie,"Tomatoes, Red Peppers, Jalapeno Peppers, Red O...",The Mexicana Pizza,January,Thursday,11,57,40
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
48615,48616,21348,ckn_alfredo_m,1,2015-12-31,2025-12-18 21:23:10,16.75,16.75,M,Chicken,"Chicken, Red Onions, Red Peppers, Mushrooms, A...",The Chicken Alfredo Pizza,December,Thursday,21,23,10
48616,48617,21348,four_cheese_l,1,2015-12-31,2025-12-18 21:23:10,17.95,17.95,L,Veggie,"Ricotta Cheese, Gorgonzola Piccante Cheese, Mo...",The Four Cheese Pizza,December,Thursday,21,23,10
48617,48618,21348,napolitana_s,1,2015-12-31,2025-12-18 21:23:10,12.00,12.00,S,Classic,"Tomatoes, Anchovies, Green Olives, Red Onions,...",The Napolitana Pizza,December,Thursday,21,23,10
48618,48619,21349,mexicana_l,1,2015-12-31,2025-12-18 22:09:54,20.25,20.25,L,Veggie,"Tomatoes, Red Peppers, Jalapeno Peppers, Red O...",The Mexicana Pizza,December,Thursday,22,9,54
48619,48620,21350,bbq_ckn_s,1,2015-12-31,2025-12-18 23:02:05,12.75,12.75,S,Chicken,"Barbecued Chicken, Red Peppers, Green Peppers,...",The Barbecue Chicken Pizza,December,Thursday,23,2,5

In [158]:
#find total sales and average sales of shop by each hour of day

sales_day_hour = df_pizza.groupby(['day','hour']).agg(

    Total_Sales_day = ('total_price' , 'sum'),
    Average_sales_day = ('total_price' , 'mean')

).reset_index()

sales_day_hour

C:\Users\Bisha\AppData\Local\Temp\ipykernel_20516\4018210301.py:3: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  sales_day_hour = df_pizza.groupby(['day','hour']).agg(

          day  hour  Total_Sales_day  Average_sales_day
0      Sunday     9             0.00                NaN
1      Sunday    10            20.75          20.750000
2      Sunday    11          4345.90          17.314343
3      Sunday    12         11947.75          17.191007
4      Sunday    13         13245.00          17.519841
..        ...   ...              ...                ...
100  Saturday    19         12568.30          16.757733
101  Saturday    20         11494.75          16.659058
102  Saturday    21          8498.10          16.662941
103  Saturday    22          4945.00          16.706081
104  Saturday    23           367.70          16.713636

[105 rows x 4 columns]

In [152]:
''' as we can see hour is not in order 
lets make it in order'''

hour_order = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24]
df_pizza['hour'] = pd.Categorical(df_pizza['hour'] , hour_order)


sales_day_hour

          day  hour  Total_Sales_day  Average_sales_day
0      Sunday     9             0.00                NaN
1      Sunday    10            20.75          20.750000
2      Sunday    11          4345.90          17.314343
3      Sunday    12         11947.75          17.191007
4      Sunday    13         13245.00          17.519841
..        ...   ...              ...                ...
100  Saturday    19         12568.30          16.757733
101  Saturday    20         11494.75          16.659058
102  Saturday    21          8498.10          16.662941
103  Saturday    22          4945.00          16.706081
104  Saturday    23           367.70          16.713636

[105 rows x 4 columns]